---
kind: type
id: T:Autodesk.Revit.DB.DWFImageFormat
source: html/28eaabb4-1285-72bb-93cd-8fac1dbfc4ce.htm
---
# Autodesk.Revit.DB.DWFImageFormat

An enumerated type listing possible image format for DWF Export.

## Syntax (C#)
```csharp
public enum DWFImageFormat
```